In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
"""1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column)."""

df['FlightNumber'] = df['FlightNumber'].fillna(0)

lst = []
for i in df['FlightNumber']:
    lst.append(i+10)

df['FlightNumber']=lst

df['FlightNumber'] = df['FlightNumber'].astype('int')
print(df)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10055      [23, 47]               KLM(!)
1      MAdrid_miLAN            10            []    <Air France> (12)
2  londON_StockhOlm         10075  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis            10          [13]       12. Air France
4   Brussels_londOn         10095      [67, 32]          "Swiss Air"

In [5]:
"""2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame."""

#From = []
#To = []
data = []

res = [i.split('_') for i in df['From_To']]
From = [i[0] for i in res]
To = [i[1] for i in res]

df['From'] = From
df['To'] = To



df = df.drop('From_To',axis=1)

cols = list(df.columns)
cols = cols[3:] + cols[:3]
df = df[cols]
print(df)

       From         To  FlightNumber  RecentDelays              Airline
0    LoNDon      paris         10055      [23, 47]               KLM(!)
1    MAdrid      miLAN            10            []    <Air France> (12)
2    londON  StockhOlm         10075  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis            10          [13]       12. Air France
4  Brussels     londOn         10095      [67, 32]          "Swiss Air"

In [6]:
"""3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)"""

capFrom = []
capTo = []
for i,j in zip(df['From'],df['To']):
    capFrom.append(i.capitalize())
    capTo.append(j.capitalize())
    


df['From'] = capFrom
df['To'] = capTo
print(df)

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10055      [23, 47]               KLM(!)
1    Madrid      Milan            10            []    <Air France> (12)
2    London  Stockholm         10075  [24, 43, 87]  (British Airways. )
3  Budapest      Paris            10          [13]       12. Air France
4  Brussels     London         10095      [67, 32]          "Swiss Air"

In [7]:
"""5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN."""

List=[]
f = []
s = []
t =[]


    
    
for i in df['RecentDelays']:
    List.append(i)



for i in List:
    if(len(i)>0):
        f.append(i[0])
    else:
        f.append('NaN')


    if(len(i)>0 and len(i)>1):
        s.append(i[1])
    else:
        s.append('NaN')

    if(len(i)>0 and len(i)>2):
        t.append(i[2])
    else:
        t.append('NaN')

    
df['delay_1'] = f
df['delay_2'] = s
df['delay_3'] = t

df = df.drop('RecentDelays',axis=1)

In [8]:
print(df)

       From         To  FlightNumber              Airline delay_1 delay_2  \
0    London      Paris         10055               KLM(!)      23      47
1    Madrid      Milan            10    <Air France> (12)     NaN     NaN
2    London  Stockholm         10075  (British Airways. )      24      43
3  Budapest      Paris            10       12. Air France      13     NaN
4  Brussels     London         10095          "Swiss Air"      67      32

  delay_3
0     NaN
1     NaN
2      87
3     NaN
4     NaN